src/cf/InformationRegisters/инт_СтатистикаОбработкиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_СтатистикаОбработкиСообщений</Name>
			<Comment>Регистр для хранения статистики времени обработки сообщений (формирование, отправка, обработка входящих)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Успешно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыОперацийСтатистики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Comment>Отличает записи об операциях, выполненных в пределах одной секунды</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ТекущийСтатусВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ТекущийСтатусВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СтатусыВходящихСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующейПопытки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_ОчередьВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВходящееСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_СообщенияКУдалению.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_СообщенияКУдалению</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаУдаления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/инт_СервисныеДействия/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_СервисныеДействия
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

// Процедура - Инт очистка устаревших сообщений
Процедура инт_ОчисткаУстаревшихСообщений() Экспорт
	// Первым шагом удаляем осиротевшие статусы входящих сообщений. Ошибка санитарной очистки не должна ломать основную очистку.
	Попытка
		УдалитьОсиротевшиеСтатусыВходящихСообщений();
	Исключение
		СообщениеОбОшибке = СтрШаблон("При удалении осиротевших статусов входящих сообщений произошла ошибка!
			| Сведения об ошибке: %1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчисткаУстаревшихСообщений",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
	КонецПопытки;

	МассивФоновыхЗаданий = Новый массив;
	МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("инт_СервисныеДействия.ОчиститьОчередьИсходящихСообщений",,,"Фоновая очистка очереди исходящих сообщений."));
	МассивФоновыхЗаданий.Добавить(ФоновыеЗадания.Выполнить("инт_СервисныеДействия.ОчиститьОчередьВходящихСообщений",,,"Фоновая очистка очереди входящих сообщений."));
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ОжидатьЗавершенияВыполнения(МассивФоновыхЗаданий);
	
	Для Каждого ФоновоеЗадание Из МассивФоновыхЗаданий Цикл
		Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно ИЛИ ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			 СообщениеОбОшибке = СтрШаблон("В процессе очистки очередей от устаревших данных произошла ошибка!
				| В фоновое задание <%1> завершено с ошибкой
				| Сведения об ошибке: %2", ФоновоеЗадание.Наименование, ФоновоеЗадание.ИнформацияОбОшибке);
			ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчисткаУстаревшихСообщений",УровеньЖурналаРегистрации.Ошибка,,,СообщениеОбОшибке);
			ВызватьИсключение СообщениеОбОшибке;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Очищает устаревшую статистику обработки сообщений.
// Вызывается регламентным заданием инт_ОчисткаСтатистикиОбработкиСообщений.
//
Процедура инт_ОчисткаСтатистикиОбработкиСообщений() Экспорт
	РегистрыСведений.инт_СтатистикаОбработкиСообщений.ОчиститьУстаревшуюСтатистику();
КонецПроцедуры

// Процедура - Удалить осиротевшие статусы входящих сообщений
// Удаляет записи регистра инт_ТекущийСтатусВходящихСообщений (вместе с историей статусов), для которых
// отсутствует запись в очереди инт_ОчередьВходящихСообщений или не заполнен идентификатор сообщения.
// Такие записи не могут быть обработаны и блокируют обработку очереди входящих сообщений.
// Вызывается первым шагом регламентного задания инт_ОчисткаУстаревшихСообщений.
//
Процедура УдалитьОсиротевшиеСтатусыВходящихСообщений() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	инт_ТекущийСтатусВходящихСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения
	               |ИЗ
	               |	РегистрСведений.инт_ТекущийСтатусВходящихСообщений КАК инт_ТекущийСтатусВходящихСообщений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.инт_ОчередьВходящихСообщений КАК инт_ОчередьВходящихСообщений
	               |		ПО инт_ТекущийСтатусВходящихСообщений.ИдентификаторСообщения = инт_ОчередьВходящихСообщений.ИдентификаторСообщения
	               |ГДЕ
	               |	инт_ОчередьВходящихСообщений.ИдентификаторСообщения ЕСТЬ NULL
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	инт_ТекущийСтатусВходящихСообщений.ИдентификаторСообщения
	               |ИЗ
	               |	РегистрСведений.инт_ТекущийСтатусВходящихСообщений КАК инт_ТекущийСтатусВходящихСообщений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.инт_ОчередьВходящихСообщений КАК инт_ОчередьВходящихСообщений
	               |		ПО инт_ТекущийСтатусВходящихСообщений.ИдентификаторСообщения = инт_ОчередьВходящихСообщений.ИдентификаторСообщения
	               |ГДЕ
	               |	инт_ТекущийСтатусВходящихСообщений.ИдентификаторСообщения = &ПустойИдентификатор";
	Запрос.УстановитьПараметр("ПустойИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	МассивИдентификаторов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИдентификаторСообщения");

	КоличествоУдаленных = 0;
	КоличествоОшибок = 0;
	Для Каждого Идентификатор Из МассивИдентификаторов Цикл
		Попытка
			РегистрыСведений.инт_ОчередьВходящихСообщений.УдалитьОсиротевшийСтатусПоИдентификатору(Идентификатор);
			КоличествоУдаленных = КоличествоУдаленных + 1;
		Исключение
			// Подробности ошибки записаны в журнал в УдалитьОсиротевшийСтатусПоИдентификатору.
			КоличествоОшибок = КоличествоОшибок + 1;
		КонецПопытки;
	КонецЦикла;

	Если МассивИдентификаторов.Количество() > 0 Тогда
		СообщениеВЖурнал = СтрШаблон("Осиротевших статусов входящих сообщений найдено: %1, удалено: %2, не удалось удалить: %3.",
			МассивИдентификаторов.Количество(), КоличествоУдаленных, КоличествоОшибок);
		ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.ОчисткаУстаревшихСообщений", УровеньЖурналаРегистрации.Информация,,,СообщениеВЖурнал);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Процедура ОчиститьОчередьИсходящихСообщений() Экспорт
		РегистрыСведений.инт_СообщенияКУдалению.ОчиститьОчередьИсходящихСообщений();
КонецПроцедуры

Процедура ОчиститьОчередьВходящихСообщений() Экспорт
		РегистрыСведений.инт_СообщенияКУдалению.ОчиститьОчередьВходящихСообщений();
КонецПроцедуры

// Процедура - Зарегистрировать обработанные сообщения потока
// Точка входа фонового задания, которое проставляет дату удаления сообщениям потока,
// обработанным до того, как в потоке задали срок хранения.
//
// Параметры:
//  ПотокДанных	 - СправочникСсылка.инт_ПотокиДанных	 - Поток данных.
//
Процедура ЗарегистрироватьОбработанныеСообщенияПотока(ПотокДанных) Экспорт
	РегистрыСведений.инт_СообщенияКУдалению.ЗарегистрироватьОбработанныеСообщенияПотока(ПотокДанных);
КонецПроцедуры

// Процедура - Запустить регистрацию обработанных сообщений потока
// Запускает фоновую регистрацию обработанных сообщений потока к удалению.
// Вызывается после записи потока, в котором изменили срок хранения обработанных сообщений.
// Неудачный запуск не отменяет запись потока. Чтобы повторить регистрацию, срок хранения нужно
// изменить: на запись потока с прежним значением срока задание не запускается.
//
// Параметры:
//  ПотокДанных	 - СправочникСсылка.инт_ПотокиДанных	 - Поток данных.
//
Процедура ЗапуститьРегистрациюОбработанныхСообщенийПотока(ПотокДанных) Экспорт
	КлючЗадания = "инт_РегистрацияСообщенийКУдалению_" + ПотокДанных.УникальныйИдентификатор();
	Если РегистрацияСообщенийКУдалениюВыполняется(КлючЗадания) Тогда
		// Запущенное задание зарегистрирует сообщения потока целиком, второе запускать незачем.
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(ПотокДанных);
	
	Попытка
		ФоновыеЗадания.Выполнить("инт_СервисныеДействия.ЗарегистрироватьОбработанныеСообщенияПотока",
			ПараметрыЗадания,
			КлючЗадания,
			"Регистрация обработанных сообщений потока к удалению.");
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		СообщениеОбОшибке = СтрШаблон("Не удалось запустить регистрацию обработанных сообщений
			|потока <%1> к удалению!
			|
			| Информация об ошибке: %2", ПотокДанных, ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("ПодсистемаИнтеграции.СообщенияКУдалению",
			УровеньЖурналаРегистрации.Ошибка, , ПотокДанных, СообщениеОбОшибке);
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РегистрацияСообщенийКУдалениюВыполняется(КлючЗадания)
	Отбор = Новый Структура("Ключ, Состояние", КлючЗадания, СостояниеФоновогоЗадания.Активно);
	Возврат ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор).Количество() > 0;
КонецФункции

#КонецОбласти
